import pytest

from context import profilescout
from profilescout.extraction.ner import NamedEntityRecognition

@pytest.fixture
def profile_string():
    return '''Почетна
        Факултет
            Историјат
            Деканат
            Катедре
            Службе
            Акредитација
            Обезбеђење квалитета
            Јавне набавке
            Културни живот у Ужицу
            Лепоте нашег краја
        Студије
        Основне студије
            Учитељ (240 ЕСПБ)
            Васпитач (240 ЕСПБ)
            Педагогија (240 ЕСПБ)
            Тренер у спорту (180 ЕСПБ)
        Мастер студије
            Мастер учитељ
            Мастер васпитач
        Докторске студије
        Други програми
                Програм 36 ЕСПБ
                Програм за информатику
                КП Учење и активни одмор
        Студенти
            Студентски парламент
            Стипендије и конкурси
            Студентски портал
        Наставници
            Редовни професори
            Ванредни професори
            Доценти
            Асистенти и наставници
            Извештаји о изборима у звање
            Конкурси за избор
        Наука
            Акредитација НИО
        Научни скупови
            Актуелни скупови
            Реализовани скупови
        Научни пројекти      
                Актуелни пројекти
                Реализовани пројекти
            Издаваштво
        Међународна сарадња     
            Новости
        ERASMUS+
                    Мобилност студената
                    Мобилност запослених
                Контакт/Инфо
            Прописи
            Вести
            Контакт
        проф. др Сања Маричић
        Редовни професор / By admin
        Име, средње слово, презиме: Сања М. Маричић
        Датум рођења: 29. 07. 1974. године
        Звање: Редовни професор
        Ужа научна, односно уметничка област: Методика наставе математике
        Катедра: Катедра за методике
        Кабинет: Број 35
        e-mail: sanjamaricic10@gmail.com, maricic@pfu.kg.ac.rs
        '''

class TestNamedEntityRecognition:
    def test(self, profile_string):
        ner = NamedEntityRecognition()
        result = ner.get_names(profile_string)
        assert "Сања Маричић" in result


